import RulesContainer from "./RulesContainer";

const title = "그린볼 개인정보 처리방침";

const markdown = `
# **그린볼 개인정보 처리방침**

그린볼은 이용자의 권리 보호를 위해 「개인정보 보호법」 및 관계 법령이 정한 바를 준수하여, 적법하게 개인정보를 처리하고 안전하게 관리하고 있습니다. 이에 「개인정보 보호법」제 30조에 따라 이용자에게 개인정보의 처리와 보호에 관한 절차 및 기준을 안내하고, 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보 처리방침을 수립 및 공개합니다.

**제1조(개인정보의 처리 목적)**
그린볼은 다음의 목적을 위해 개인정보를 처리합니다. 수집된 개인정보는 명시된 목적 이외의 용도로는 사용되지 않으며, 목적이 변경될 경우 「개인정보 보호법」 제18조에 따라 사전 동의를 받는 등 필요한 조치를 이행할 예정입니다. 개인정보 수집 및 이용은 개인정보 보호법 및 정보통신망 이용촉진 및 정보보호 등에 관한 법률에 근거합니다.

1. 회원 가입 및 관리: 회원 가입 의사 확인, 서비스 제공을 위한 본인 식별 및 인증, 회원 자격 유지 및 관리, 불법 이용 방지, 문의 사항 또는 불만 처리, 공지 사항 전달의 목적으로 개인정보를 처리합니다.
2. 서비스 제공: 사용자 정보 및 기록에 따른 개인화된 맞춤 서비스 제공을 목적으로 개인정보를 처리합니다.
3. 민원 처리: 문의사항 및 불만 처리, 이용자의 고충 해결을 목적으로 개인정보를 처리합니다.

**제2조(처리하는 개인정보 항목)**

그린볼은 서비스 제공을 위해 필요 최소한의 범위에서 개인정보를 수집·이용합니다.

개인정보 수집·이용 동의를 거부할 권리가 있으며, 동의를 거부하시면 회원에게 제공되는 서비스가 제한될 수 있습니다. 

| 구분 | 유형 | 수집 항목 | 수집 및 이용 목적 | 보유 및 이용 기간 |
| --- | --- | --- | --- | --- |
| SNS 간편 가입 시(카카오/구글) | 필수 | 이름, 이메일 | 회원 가입 의사 확인, 서비스 제공을 위한 본인 식별 및 인증, 회원 자격 유지 및 관리, 불법 이용 방지, 문의사항 또는 불만 처리, 공지 사항 전달, 
개인화된 서비스 제공(북마크 및 냉장고 재료 관리 기능) | 회원 탈퇴 시까지 |
| 식단 코치 이용 시 | 필수 | 주당 평균 운동 횟수, 하루 물 섭취량, 주당 피로/숙취 경험 횟수, 평균 수면 시간, 주당 군것질/패스트푸드 섭취 빈도, 식단 목표, 피하는 음식, 원하는 영양 기준, 스트레스 해소 루틴, 불안감·우울감 경험 횟수, 식사 후 칼로리·체중 증가에 대한 죄책감, 만성질환 여부 | (민감정보 포함)사용자 정보 및 기록에 따른 개인화된 맞춤 서비스 제공 | 회원 탈퇴 시까지 |

또한 서비스 이용 과정에서 아래와 같은 정보들이 자동으로 생성되어 수집될 수 있습니다.

- IP 주소, 운영체제, 브라우저 종류, 쿠키 및 세션 정보, 방문일시, 부정 이용 기록, 서비스 이용 기록 등의 정보

**제3조(개인정보의 제3자 제공에 관한 사항)**
그린볼은 원칙적으로 개인정보를 제3자에게 제공하지 않습니다. 단, 법률에 특별한 규정이 있거나 이용자의 동의를 받은 경우에만 제공될 수 있습니다. 현재 제3자 제공은 이루어지지 않고 있으며, 향후 제공 시 사전 동의를 받겠습니다.

**제4조(정보 주체와 법정대리인의 권리·의무 및 행사 방법)**
이용자는 언제든지 개인정보 열람, 정정, 삭제, 처리 정지를 요청할 수 있습니다. 이러한 요청은 서면, 이메일, 홈페이지를 통해 가능하며, 그린볼은 요청 접수 후 10일 이내에 지체 없이 조치하겠습니다.

**제5조(개인정보의 처리 및 보유기간)**
그린볼은 법령에 따른 개인정보 보유 기간 또는 정보 주체로부터 동의받은 기간 동안 개인정보를 보유·처리합니다.

1. 회원 가입 및 관리: 회원 탈퇴 시까지(상법 및 전자상거래법 등 관련 법령에 따라 일정 기간 보관 필요시 해당 기간 보관)
2. 서비스 제공: 서비스 제공 완료 후 1년간 보관 (전자상거래 등에서의 소비자 보호에 관한 법률에 근거)
3. 민원 관리: 민원 처리 완료 후 소비자 분쟁 해결을 위한 기록을 3년간 보관 (소비자기본법에 근거)

**제6조(개인정보의 파기 절차 및 방법)**
보유 기간이 지나거나 처리 목적이 달성된 개인정보는 지체 없이 파기합니다.

1. 전자적 파일: 복구 불가능한 방식으로 영구 삭제
2. 종이 문서: 분쇄 또는 소각하여 파기

**제7조(개인정보의 안전성 확보 조치)**
그린볼은 이용자들의 개인정보 보호를 처리하는 데 있어 개인 정보가 분실, 도난, 유출, 변조 또는 훼손되지 않도록 안정성의 확보를 위해 다음과 같은 기술적 대책을 강구하고 있습니다.

기술적 조치: 접근 권한 관리, 암호화 기술 적용

**제8조(개인정보 보호 책임자)**
그린볼은 개인정보 처리에 관한 업무를 총괄하는 개인정보 보호 책임자를 지정하고 있습니다.

- 성명: 성효빈
- 이메일 주소: greenbowls15@gmail.com

이용자는 개인정보 보호 책임자에게 개인정보 관련 문의, 불만 처리, 피해 구제 등을 요청할 수 있습니다.

**제9조(정부주체의 권익 침해에 대한 구제 방법)**
이용자는 개인정보 침해로 인한 구제를 위해 아래 기관에 문의할 수 있습니다.

1. 개인정보 침해신고센터: (국번 없이) 118 / [http://privacy.kisa.or.kr](http://privacy.kisa.or.kr/)
2. 개인정보 분쟁조정위원회: 1833-6972 / [http://www.kopico.go.kr](http://www.kopico.go.kr/)

**제10조(개인정보 처리방침 변경에 관한 사항)**

법률이나 서비스의 변경사항을 반영하기 위한 목적 등을 개인정보처리방침을 수정할 수 있습니다. 개인정보처리방침이 변경되는 경우 변경 사항을 게시하며, 변경된 개인정보처리방침은 게시한 날로부터 7일 후에 효력이 발생합니다. 

이 개인정보 처리방침은 [2025년 3월 3일]부터 적용됩니다.
`;
const Privacy = () => {
  return <RulesContainer markdown={markdown} title={title} />;
};

export default Privacy;
