import RulesContainer from "./RulesContainer";

const title = "서비스 이용 약관";

const markdown = `# 서비스 이용 약관

**제1조(목적)**

이 약관은 ‘그린볼’을 이용하는 사용자와 서비스 운영자 간의 서비스 이용과 관련된 권리, 의무 및 책임을 규정함을 목적으로 합니다.

**제2조(정의)**

1. ‘서비스’란 그린볼이 운영하는 웹사이트 및 관련 기능을 포함하며, 사용자가 이를 통해 콘텐츠를 이용하거나 저장하고, 공유할 수 있도록 하는 디지털 환경을 의미합니다.
2. ‘사용자’란 ‘서비스’에 접속하여 이 약관에 따라 ‘서비스’를 사용하는 회원과 비회원을 말합니다.
3. ‘회원’이라 함은 ‘서비스’에 회원등록을 한 자로서, 계속해서 ‘서비스’를 이용할 수 있는 자를 말합니다.
4. ‘비회원’이라 함은 회원에 가입하지 않고 ‘서비스’를 이용하는 자를 말합니다.

**제3조(약관의 효력 및 변경)**

1. 이 약관은 서비스가 그 내용을 서비스 초기 화면을 통해 게시하고 이용자가 이에 동의함으로써 효력을 발생합니다.
2. 서비스는 「전자상거래 등에서의 소비자보호에 관한 법률」, 「약관의 규제에 관한 법률」, 「전자문서 및 전자거래 기본법」, 「전자금융거래법」, 「전자서명법」, 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」, 「방문판매 등에 관한 법률」, 「소비자기본법」 등 관련 법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
3. 서비스가 약관을 개정할 때 적용일자 및 개정 사유를 명시하여 현행약관과 함께 초기 화면에 그 적용 일자 7일 이전부터 적용 일자 전일까지 공지합니다. 다만, 이용자에게 불리하게 약관 내용을 변경하할 때는 최소한 30일 이상의 사전 유예기간을 두고 공지합니다. 이 경우 서비스는 개정 전 내용과 개정 후 내용을 명확하게 비교하여 이용자가 알기 쉽도록 표시합니다.

**제4조(약관 외 준칙)**

1. 이 약관은 제공하는 서비스에 관한 이용 규정 및 별도 약관과 함께 적용됩니다.
2. 이 약관에 명시되지 않은 사항과 이 약관의 해석에 관해서는 관련 법령 및 상 관례에 따릅니다.

**제5조(회원가입)**

1. 이용자는 서비스가 정한 가입 양식에 따라 로그인하면 이 약관에 동의하는 것으로 간주하며 자동으로 회원가입이 됩니다.
2. 서비스는 제1항과 같이 회원으로 가입할 것을 신청한 이용자 중 다음 각호에 해당하지 않는 한 회원으로 등록합니다.
    
    (1) 가입 신청자가 이전에 회원자격을 상실한 적이 있는 경우, 다만 회원자격 상실 후 3년이 지난 자로서 당사의 회원 재가입 승낙을 얻은면 예외로 한다.
    
    (2) 등록 내용에 허위, 기재 누락, 오기가 있는 경우
    
    (3) 기타 회원으로 등록하는 것이 서비스의 기술상 현저히 지장이 있다고 판단되는 경우
    
3. 회원가입 계약의 성립 시기는 서비스의 승낙이 회원에게 도달한 시점으로 합니다.

**제6조(회원 탈퇴 및 자격 상실 등)**

1. 회원은 서비스에 언제든지 탈퇴를 요청할 수 있으며 서비스는 즉시 회원 탈퇴를 처리합니다.
2. 회원이 다음 각호의 사유에 해당하는 경우, 서비스는 회원자격을 제한 및 정지시킬 수 있습니다.
    
    (1) 가입 신청 시에 허위 내용을 등록한 경우
    
    (2) 서비스를 이용하여 법령 또는 이 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우
    
3. 서비스가 회원 자격을 제한·정지 시킨 후, 동일한 행위가 2회 이상 반복되거나 30일 이내에 그 사유가 시정되지 아니하는 경우 서비스는 회원자격을 상실시킬 수 있습니다.
4. 서비스가 회원자격을 상실시키는 경우에는 회원등록을 말소합니다. 이 경우 회원에게 이를 통지하고, 회원등록 말소 전에 최소한 14일 이상의 기간을 정하여 소명할 기회를 부여합니다.

**제7조(개인정보보호)**

1. 서비스는 이용자의 개인정보 수집 시 서비스 제공을 위하여 필요한 범위에서 최소한의 개인정보를 수집합니다.
2. 서비스는 이용자의 개인정보를 수집ㆍ이용하는 때에는 당해 이용자에게 그 목적을 고지하고 동의를 받습니다.
3. 서비스는 수집된 개인정보를 목적 외의 용도로 이용할 수 없으며, 새로운 이용 목적이 발생한 경우 또는 제3자에게 제공하는 경우에는 이용ㆍ제공 단계에서 당해 이용자에게 그 목적을 고지하고 동의를 받습니다. 다만, 관련 법령에 달리 정함이 있는 경우에는 예외로 합니다.
4. 서비스가 제2항과 제3항에 의해 이용자의 동의를 받아야 하는 경우에는 개인정보관리 책임자의 신원(소속, 성명 및 전화번호, 기타 연락처), 정보의 수집 목적 및 이용 목적, 제3자에 대한 정보제공 관련사항(제공받은 자, 제공 목적 및 제공할 정보의 내용) 등 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」 제22조 제2항이 규정한 사항을 미리 명시하거나 고지해야 하며 이용자는 언제든지 이 동의를 철회할 수 있습니다.
5. 서비스 또는 그로부터 개인정보를 제공받은 제3자는 개인정보의 수집 목적 또는 제공받은 목적을 달성한 때에는 당해 개인정보를 지체 없이 파기합니다.

**제8조(이용자의 의무)**

1. 이용자는 다음 행위를 하여서는 안 됩니다.
    
    (1) 신청 또는 변경 시 허위 내용의 등록
    
    (2) 타인의 정보 도용
    
    (3) 그린볼에 게시된 정보를 변경하거나 고의로 변경을 시도하는 행위
    
    (4) 서비스가 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등의 송신 또는 게시
    
    (5) 그린볼 및 기타 제3자의 저작권 등 지식재산권에 대한 침해
    
    (6) 그린볼 및 기타 제3자의 명예를 손상하거나 업무를 방해하는 행위
    
    (7) 외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서양속에 반하는 정보를 서비스에 공개 또는 게시하는 행위
    
2. 이용자는 관계 법령, 약관, 서비스 이용 안내 및 서비스상에 공지한 주의 사항, 그린볼이 서비스 이용과 관련하여 이용자에게 통지하는 사항 등을 준수하여야 하며, 기타 그린볼의 업무에 방해되는 행위를 하여서는 안 됩니다.
    
    (1) 고객불만사항을 처리하는 모든 절차를 진행 중에 통상의 범위를 벗어나는 욕설, 비하 등의 언행 및 위력을 과시하는 등의 공포를 유발하는 행위
    

**제9조(회원의 ID 및 비밀번호에 대한 의무)**

1. 제7조의 경우를 제외한 ID와 비밀번호에 관한 관리책임은 회원에게 있습니다.
2. 회원은 자신의 ID 및 비밀번호를 제3자에게 이용하게 해서는 안됩니다.
3. 회원이 자신의 ID 및 비밀번호를 도난당하거나 제3자가 사용하고 있음을 인지한 경우에는 바로 서비스에 통보하고 서비스의 안내가 있는 경우에는 그에 따라야 합니다.

**제10조(서비스의 의무)**

1. 서비스는 법령과 이 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며 이 약관이 정하는 바에 따라 지속적이고, 안정적으로 재화·용역을 제공하는 데 최선을 다하여야 합니다.
2. 서비스는 이용자가 안전하게 인터넷 서비스를 이용할 수 있도록 이용자의 개인정보(신용정보 포함)보호를 위한 보안 시스템을 갖추어야 합니다.
3. 서비스는 이용자가 원하지 않는 영리 목적의 광고성 전자우편을 발송하지 않습니다.

**제11조(그린볼 서비스)**

1. 그린볼은 다음 서비스를 제공합니다.
    
    (1) AI 레시피 추천
    
    (2) 냉장고 관리
    
    (3) AI 맞춤형 식단 추천
    
    (4) 기타 그린볼이 정하는 서비스
    
2. 회원은 모든 관련 법률, 규칙, 규정 또는 서비스 관련된 제한에 따라 서비스(서비스 내의 모든 기능을 포함)를 이용하는 데 동의합니다. 또한 회원은 서비스에 접근하는 데 로봇, 스파이더, 스크레이퍼나 기타 자동화 수단을 이용하거나, 플랜핏 서비스를 통해 접근할 수 있는 소프트웨어나 기타 제품, 프로세스를 역컴파일, 리버스 엔지니어링 또는 역어셈블하거나, 코드나 제품을 삽입하거나 어떤 방식으로든 서비스 콘텐츠를 조작하거나, 데이터 마이닝, 데이터 수집 또는 추출 방법을 사용해서는 안 됩니다. 또한 회원은 소프트웨어 바이러스나 기타 컴퓨터 코드, 파일이나 프로그램을 포함하여, 서비스와 관련된 컴퓨터 소프트웨어나 하드웨어 또는 통신 장비의 기능을 방해, 파괴 또는 제한하기 위해 설계된 자료를 업로드, 게시, 이메일 전송, 또는 다른 방식으로 발송, 전송해서도 안 됩니다. 회원이 본 이용 약관을 위반하거나 불법적이거나 사기성 있는 서비스 사용에 가담하는 경우, 회원의 서비스 사용을 종료시키거나 제한할 수 있습니다.
3. 그린볼의 서비스는 장비의 유지∙보수를 위한 정기 또는 임시 점검 또는 다른 상당한 이유로 서비스의 제공이 일시 중단될 수 있습니다.
4.  그린볼의 서비스는 타당한 이유가 있는 경우 운영상, 기술상의 필요에 따라 제공하고 있는 전부 또는 일부 서비스를 변경할 수 있습니다. 또한 무료로 제공되는 서비스의 일부 또는 전부를 회사의 정책 및 운영의 필요로 수정, 중단, 변경할 수 있으며 이에 대한 관련법에 특별한 규정이 없는 한 별도의 보상을 제공하지는 않습니다.

**제12조(재판권 및 준거법)**

1. 서비스와 이용자 간에 발생한 전자상거래 분쟁에 관한 소송은 제소 당시 이용자의 주소에 의하고, 주소가 없는 경우에는 거소를 관할하는 지방법원의 전속관할로 합니다. 다만, 제소 당시 이용자의 주소 또는 거소가 분명하지 않거나 외국 거주자의 경우에는 민사소송법상의 관할법원에 제기합니다.
2. 서비스와 이용자 간에 제기된 전자상거래 소송에는 한국법을 적용합니다.`;

const Terms = () => {
  return <RulesContainer markdown={markdown} title={title} />;
};

export default Terms;
